app/controllers/questions_controller.rb

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 3)
INSERT INTO `questions` (`question_number`, `question_type`, `question_comment`, `question_text`, `survey_id`, `created_at`, `updated_at`) VALUES('1', 'm', 'baby don\'t hurt me', 'What is love?', 3, '2010-02-26 03:30:33', '2010-02-26 03:30:33')
---
  def create
    @survey = Survey.find(params[:survey_id])
    @question = @survey.questions.create!(params[:question])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 3)
---
  def show
    @question = Question.find(params[:id])
    @survey = Survey.find(@question.survey_id)

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def edit
    @question = Question.find(params[:id])