app/controllers/surveys_controller.rb

  def index
    @user = current_user
    @surveys = Survey.all
---
SELECT * FROM `surveys`

  def show
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def edit
    @survey = Survey.find(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)

  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save
---
INSERT INTO `surveys` (`survey_name`, `survey_date`, `survey_creator`, `created_at`, `updated_at`) VALUES('Testing123', '2010-02-26', 'doug', '2010-02-26 02:49:08', '2010-02-26 02:49:08')

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
DELETE FROM `surveys` WHERE `id` = 1