app/controllers/users_controller.rb

INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`) VALUES('createdadmin', '', 'drogers@iastate.edu', '06ba8648968511aa03def23f9604693a5b10c2bd', '8b8ddc64aa134d3c9bc5b2ade778cf6f350e2c8d', '2010-02-26 05:21:55', '2010-02-26 05:21:55', NULL, NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.role_ids = params[:user][:role_ids]
    success = @user && @user.save